matematch/app/controllers/auth_controller.rb

  def login
    username = params['user']['username']
    password = params['user']['password']

    user = User.find_by(name: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "BillyBalls"]]