matematch/app/controllers/chats_controller.rb

SELECT DISTINCT "chats"."to_id" FROM "chats" WHERE "chats"."from_id" = ?  [["from_id", 10]]
SELECT "chats".* FROM "chats"
SELECT "users".* FROM "users" WHERE "users"."id" IN (8, 1, 2, 4, 8)
---
  def index
    toids = Chat.select(:to_id).distinct.where(:from_id => currentUserId).map {|chat| chat.to_id}
    fromids = Chat.select(:from_id).distinct.where(:to_id => currentUserId).map {|chat| chat.from_id}

    # make sure we have some chat userids before we access the usernames
    if (toids.length + fromids.length > 0)
      users = User.where(:id => toids+fromids)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "curiousplatupus"]]
SELECT "chats"."from_id", "chats"."msg" FROM "chats" WHERE ((from_id = 3 AND to_id = 1) OR (from_id = 1 AND to_id = 3))  ORDER BY "chats"."created_at" DESC
SELECT "chats"."from_id", "chats"."msg" FROM "chats"
---
  def show
    username = params[:id]
    user1 = User.find(currentUserId)
    user2 = User.find_by({name: username})
    chats = Chat.select(:from_id,:msg).where("(from_id = ? AND to_id = ?) OR (from_id = ? AND to_id = ?)", currentUserId, user2.id, user2.id, currentUserId).order(created_at: :desc)
    formattedmessages = chats.map do |chat|

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "curiousplatupus"]]
INSERT INTO "chats" ("msg", "from_id", "to_id", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["msg", "Hey No Ways"], ["from_id", 3], ["to_id", 1], ["read", "f"], ["created_at", "2015-05-31 18:10:38.529662"], ["updated_at", "2015-05-31 18:10:38.529662"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "watsonfeed" = ?, "personality" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def create
    to_user = User.find_by(name: params[:to_username])

    chat = Chat.new(msg: params[:message], from_id: currentUserId, to_id: to_user.id, read: false)

    if chat.save

      # evan, i'm appending the msg to watson text here
      currentUser = User.find(currentUserId)
      updated_watsonfeed = currentUser.watsonfeed + " \n " + params[:message]

      currentUser.update({ watsonfeed: updated_watsonfeed, personality: nil})