matematch/app/controllers/current_users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    render json: User.find(currentUserId)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "users" SET "description" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    @user = User.find(currentUserId)
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "watsonfeed" = ?, "personality" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def watsonfeed
    user = User.find(currentUserId)
    if user.watsonfeed
      user.update({watsonfeed: (user.watsonfeed + "\n" + params[:text]), personality: nil})