matematch/app/controllers/endorsements_controller.rb

  def index
    # @endorsements = Endorsement.all

    @endorsements = Endorsement.where({endorsee_id: params[:user_id]}).group(:skill).count
---
SELECT COUNT(*) AS count_all, skill AS skill FROM "endorsements" WHERE "endorsements"."endorsee_id" = ? GROUP BY "endorsements"."skill"  [["endorsee_id", 1]]