matematch/app/controllers/reviews_controller.rb

  def index
    # @reviews = Review.all
    @reviews = Review.where({room_id: params[:room_id]})
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ?  [["room_id", 1]]