matematch/app/controllers/room_reviews_controller.rb

SELECT "room_reviews".* FROM "room_reviews"
---
  def index
    @room_reviews = RoomReview.all