matematch/app/controllers/rooms_controller.rb

  def index
    pet = params['pet_friendly']
    neighborhood = params["neighborhood"]
    min = params["price_min"]
    max = params["price_max"]

    if neighborhood != nil && min != nil && max != nil && pet != "nil"
      @rooms = Room.where("neighborhood = ? AND price >= ? AND price <= ? AND petfriendly = ?", neighborhood, min, max, pet);
    elsif neighborhood != nil && min != nil && max != nil
      @rooms = Room.where("neighborhood = ? AND price >= ? AND price <= ?", neighborhood, min, max);
    elsif min != nil && max != nil && pet != "nil"
      @rooms = Room.where("price >= ? AND price <= ? AND petfriendly = ?", min, max, pet);
    elsif neighborhood != nil && max != nil && pet != "nil"
      @rooms = Room.where("neighborhood = ? AND price <= ? AND petfriendly = ?", neighborhood, max, pet);
    elsif neighborhood != nil && min != nil && pet != "nil"
      @rooms = Room.where("neighborhood = ? AND price >= ? AND petfriendly = ?", neighborhood, min, pet);
    elsif neighborhood != nil && max != nil
      @rooms = Room.where("neighborhood = ? AND price <= ?", neighborhood, max);
    elsif max != nil && pet != "nil"
      @rooms = Room.where("price <= ? AND petfriendly = ?", max, pet);
    elsif neighborhood != nil && pet != "nil"
      @rooms = Room.where("neighborhood = ? AND petfriendly = ?", neighborhood, pet);
    elsif neighborhood != nil
      @rooms = Room.where("neighborhood = ?", neighborhood);
    elsif pet != "nil"
      @rooms = Room.where("petfriendly = ?", pet);
    elsif min != nil && max != nil
      @rooms = Room.where("price >= ? AND price <= ?", min, max);
    else
      @rooms = Room.all
---
SELECT "rooms".* FROM "rooms" WHERE (neighborhood = 'Brooklyn' AND price >= '0' AND price <= '100' AND petfriendly = 'true')
SELECT "rooms".* FROM "rooms"

  def create
    room = Room.find_by(owner_id: currentUserId)
    if room
      room.update(room_params)
      render json: room, status: :created, location: room
    else
      room = Room.new(room_params)
      room.owner_id = currentUserId
      if room.save
---
INSERT INTO "rooms" ("description", "price", "neighborhood", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Great Cozy Place"], ["price", 6734], ["neighborhood", "Sesame Street"], ["created_at", "2015-05-27 22:13:12.685677"], ["updated_at", "2015-05-27 22:13:12.685677"]]