matematch/app/controllers/users_controller.rb

  def index
    #@users = User.all
    @users = User.where("hasRoom = ? AND gender = ? AND description LIKE ?", false, params["gender"].downcase, params["description"]);
---
SELECT "users".* FROM "users" WHERE "users"."hasRoom" = 't'