matematch/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (hasRoom = 'f' AND gender = 'female' AND description LIKE 'petite')
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "username", "budget", "gender", "occupation", "email", "phone", "password_digest", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save