matematch/app/controllers/watson_controller.rb

  def show
    updateWatsonCache(currentUserId)
    updateWatsonCache(params[:id]) if params[:id] != "undefined"

    user1 = User.find(currentUserId)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]